Revit 2026 API

# AnalyticalSurfaceBaseIsOuterContourValid Method

---

Checks if contour is valid for this Analytical Surface.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsOuterContourValid(
	CurveLoop contour
)
```
```vb
Public Function IsOuterContourValid (
	contour As CurveLoop
) As Boolean
```
```cpp
public:
bool IsOuterContourValid(
	CurveLoop^ contour
)
```
```fsharp
member IsOuterContourValid :
        contour : CurveLoop -> bool
```

#### Parameters

contour CurveLoop
     The curve loop to be checked.

#### Return Value

Boolean Returns true if curve loop is ok, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method verifies if the contour is valid for a planar Analytical Surface or for a curved Analytical Panel.

#### Reference

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace